portfolio-backend/app/controllers/api/v1/comments_controller.rb

  def create
    comment = @project.comments.build(comment_params)

    if comment.save
---
INSERT INTO "comments" ("project_id", "author", "email", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["project_id", 4], ["author", "Jackie"], ["email", "jackie@gmail.com"], ["content", "test comment"], ["created_at", "2020-07-07 17:26:11.055453"], ["updated_at", "2020-07-07 17:26:11.055453"]]

  def get_project
    @project ||= Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def get_comment
    @comment ||= Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]