portfolio-backend/app/controllers/api/v1/projects_controller.rb

  def index
    projects = Project.all
---
SELECT "projects".* FROM "projects"

  def show
    project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]