portfolio-backend/app/controllers/api/v1/stacks_controller.rb

  def index
    stacks = Stack.all
---
SELECT "stacks".* FROM "stacks"